#ifndef __SCHEDULER_H
#define __SCHEDULER_H
/***********************************************************************************************************************************
 ** 【文件名称】  scheduler.h
 ** 【编写人员】  魔女开发板团队
 ** 【更新分享】  Q群文件夹        
 ** 【淘    宝】  魔女开发板      https://demoboard.taobao.com
 ***********************************************************************************************************************************
 ** 【功能描述】  
 **
 ** 【适用平台】  
 **                 
 ** 【移植说明】  
 ** 
 ** 【更新记录】  
 **               
***********************************************************************************************************************************/ 
#include "stm32f4xx.h"
#include "bsp_UART.h"
#include "bsp_LCD_ILI9341.h"
#include "bsp_XPT2046.h"
#include "bsp_led.h"
#include "bsp_CAN.h"




/*****************************************************************************
 ** 声明全局函数
****************************************************************************/
void Scheduler_Init(void);      // 配置任务调试器，主要是配置SysTick
void Scheduler_Run(void);       // 任务调度

void DelayMS(uint32_t ms);
void DelayUS(uint32_t us);
u32 Scheduler_GetTimeInterval(void);
void Scheduler_TestRunTimes(void);


#endif

